import xmltodict,os,requests
from .models import Clothe,CategoryPrice,CategoryClothe,ClothePartner,ClotheMale,ClotheCountry


categoryAW={
    "4676": ("Кроссовки", "Женский"),
    "6526": ("Шорты", "Женский"),
    "2454": ("Платья, сарафаны и туники", "Женский"),
    "262": ("Джинсы", "Женский"),
    "2452": ("Брюки", "Женский"),
    "307": ("Белье", "Женский"),
    "2465": ("Куртки и пальто", "Мужской"),
    "6550": ("Брюки", "Мужской"),
    "6532": ("Шорты", "Мужской"),
    "2720": ("Футболки", "Мужской"),
    "6974": ("Рубашки", "Женский"),
    "269": ("Кофты", "Мужской"),
    "2707": ("Кроссовки", "Мужской"),
    "2453": ("Брюки", "Мужской"),
    "2383": ("Шорты", "Женский"),
    "6541": ("Сумки", "Женский"),
    "300": ("Майки и поло", "Женский"),
    "2366": ("Ремни", "Женский"),
    "305": ("Кофты", "Женский"),
    "2468": ("Кофты", "Мужской"),
    "257": ("Рубашки", "Мужской"),
    "339": ("Рубашки", "Мужской"),
    "2685": ("Брюки", "Женский"),
    "295": ("Кошельки", "Мужской"),
    "2368": ("Рюкзаки", "Женский"),
    "2407": ("Рюкзаки", "Мужской"),
    "2704": ("Майки и поло", "Мужской"),
    "274": ("Футболки", "Женский"),
    "4674": ("Кеды", "Женский"),
    "4778": ("Кроссовки", "Мужской"),
    "298": ("Сумки", "Женский"),
    "299": ("Сумки", "Мужской"),
    "2423": ("Шорты", "Мужской"),
    "6524": ("Брюки", "Женский"),
    "2734": ("Носки", "Мужской"),
    "4678": ("Туфли", "Женский"),
    "327": ("Носки", "Женский"),
    "2447": ("Рубашки", "Женский"),
    "273": ("Кофты", "Женский"),
    "316": ("Юбки", "Женский"),
    "302": ("Юбки", "Женский"),
    "2531": ("Очки", "Женский"),
    "278": ("Куртки и пальто", "Женский"),
    "2336": ("Пиджаки и жакеты", "Мужской"),
    "2471": ("Кошельки", "Женский"),
    "6114": ("Белье", "Мужской"),
    "4730": ("Туфли", "Мужской"),
    "2496": ("Рубашки", "Женский"),
    "2526": ("Белье", "Женский"),
    "308": ("Белье", "Женский"),
    "2535": ("Белье", "Женский"),
    "287": ("Белье", "Мужской"),
    "4776": ("Туфли", "Мужской"),
    "292": ("Кофты", "Женский"),
    "2715": ("Ботинки", "Женский"),
    "6528": ("Пиджаки и жакеты", "Женский"),
    "258": ("Куртки и пальто", "Мужской"),
    "3818": ("Куртки и пальто", "Женский"),
    "276": ("Куртки и пальто", "Женский"),
    "314": ("Куртки и пальто", "Женский"),
    "309": ("Белье", "Женский"),
    "293": ("Шапки", "Мужской"),
    "2464": ("Майки и поло", "Мужской"),
    "4773": ("Ботинки", "Мужской"),
    "2354": ("Шапки", "Женский"),
    "4677": ("Кроссовки", "Женский"),
    "2353": ("Шапки", "Женский"),
    "4782": ("Кеды", "Мужской"),
    "6522": ("Белье", "Женский"),
    "281": ("Ремни", "Мужской"),
    "2475": ("Шапки", "Женский"),
    "6481": ("Зонты", "Женский"),
    "260": ("Джинсы", "Мужской"),
    "4777": ("Туфли", "Мужской"),
    "2466": ("Кофты", "Мужской"),
    "2702": ("Белье", "Мужской"),
    "2460": ("Кофты", "Мужской"),
    "4673": ("Кеды", "Женский"),
    "6527": ("Пиджаки и жакеты", "Женский"),
    "277": ("Брюки", "Женский"),
    "4781": ("Кеды", "Мужской"),
    "2709": ("Часы", "Мужской"),
    "3158": ("Куртки и пальто", "Мужской"),
    "272": ("Кофты", "Женский"),
    "6545": ("Сумки", "Мужской"),
    "337": ("Майки и поло", "Мужской"),
    "2677": ("Часы", "Женский"),
    "317": ("Юбки", "Женский"),
    "335": ("Брюки", "Мужской"),
    "5793": ("Белье", "Мужской"),
    "275": ("Платья, сарафаны и туники", "Женский"),
    "6540": ("Сумочки", "Женский"),
    "3195": ("Белье", "Женский"),
    "7065": ("Белье", "Женский"),
    "319": ("Носки", "Женский"),
    "7066": ("Куртки и пальто", "Женский"),
    "2355": ("Шапки", "Женский"),
    "6530": ("Белье", "Мужской"),
    "2699": ("Пиджаки и жакеты", "Женский"),
    "303": ("Пиджаки и жакеты", "Мужской"),
    "294": ("Шапки", "Женский"),
    "2541": ("Шапки", "Мужской"),
    "6525": ("Шорты", "Женский"),
    "2703": ("Куртки и пальто", "Мужской"),
    "4772": ("Ботинки", "Мужской"),
    "3196": ("Носки", "Женский"),
    "2529": ("Очки", "Женский"),
    "4680": ("Туфли", "Женский"),
    "2708": ("Сумки", "Мужской"),
    "6523": ("Белье", "Женский"),
    "4780": ("Кеды", "Мужской"),
    "6217": ("Белье", "Мужской"),

}

def parseAW():
    goods_url = ClothePartner.objects.get(name='Answear').url
    markup_url = ClothePartner.objects.get(name='Answear').markup_url
    r = requests.get(goods_url, stream=True)
    r.encoding = ('utf-8')
    print ('loading prices...')
    goods = xmltodict.parse(r.text)
    r2 = requests.get(markup_url, stream=True)
    r2.encoding = ('utf-8')
    print ('loading markups...')
    marks = xmltodict.parse(r2.text)
    c=Clothe.objects.filter(partner__name='Answear')
    c.delete()
    cnt=0
    for i in goods[u'yml_catalog'][u'shop'][u'offers'][u'offer']:
        if i[u'category_id'] in categoryAW:
            c = Clothe()
            c.article_id = i[u'@id']
            print (c.article_id)
            c.description = i[u'description'][:i[u'description'].find('\n')]
            print (c.description)
            c.price = round(float(i[u'price']))
            print (c.price)
            try:
                c.markup = round((1-round(float([j for j in marks[u'yml_catalog'][u'shop'][u'offers'][u'offer'] if j[u'@id']==i[u'@id']][0][u'price']))/round(float([j for j in marks[u'yml_catalog'][u'shop'][u'offers'][u'offer'] if j[u'@id']==i[u'@id']][0][u'oldprice'])))*100)
            except:
                c.markup = 0
            print (c.markup)
            c.link_partner_to_product=i[u'url']
            c.link_image_to_product = i[u'picture']
            c.currency = CategoryPrice.objects.get(name='Рубли')
            print (i[u'category_id'])
            c.category = CategoryClothe.objects.get(name = categoryAW[i[u'category_id']][0])
            print (c.category.name)
            c.partner = ClothePartner.objects.get(name='Answear')
            c.male = ClotheMale.objects.get(name = categoryAW[i[u'category_id']][1])
            print (c.male.name)
            c.country = ClotheCountry.objects.get(name='Россия')
            cnt+=1
            print ('Good - ',cnt)
            c.save()

    r.close()
    r2.close()
    print (goods.keys(),len(c))